"""Создайте класс пользователя (ФИО, дата рождения), к каждому методу составьте doctrings и
постарайтесь максимально следовать правилам, описанным в PEP 8. Вы можете создавать любое количество методов,
с целью потренироваться, но как минимум класс должен содержать:
1. get_short_name
2. get_full_name
3. get_age
4. get_initials
5. set_full_name
(принимаем строку вида «Петров Иван Иванович», которую необходимо разбить по соответствующим полям.
Условимся, что порядок будет следующим: Фамилия Имя Отчество)
Создайте код, который будет использовать все разработанные вами методы и поля, соблюдая PEP 8."""
