# Даны две переменные:
# n1 = 47
# n2 = 4
# Создайте переменную с именем res1 и присвойте ей результат целочисленного деления n1 на n2.
# Создайте переменную с именем res2 и присвойте ей остаток от деления n1 на n2
n1 = 47
n2 = 4
res1 = n1 // n2
res2 = n1 % n2
print(res1)
print(res2)
