# Создайте переменную str1 и присвойте ей значение - First line of text
# Создайте переменную str2 и присвойте ей значение - Second line of text
# Сложите строки с пробелом между ними, присвойте результат переменной string и выведите ее на печать
str1 = "First line of text"
str2 = "Second line of text"
string = str1 + " " + str2
print(string)