# Создайте переменную A, присвойте ей значение 10.
# Выведете сообщение на консоль “A – is greater than 5”, только при условии, если A больше 5.
A = 10
if A > 5:
    print("A – is greater than 5")