"""Даны числа a и b (a < b). Выведите сумму всех натуральных чисел от a до b (включительно)."""
tmp_a = 2
tmp_b = 20
while tmp_a <= tmp_b:
    print(tmp_a, end = ' ')
    tmp_a += 1
