"""Сохраните в файл данные об изменениях температуры в течение трёх месяцев
(сгенерируйте случайные значения- 90 элементов) и, используя средства Numpy,
загрузите эти данные из файла в ndarray (плоский список, значения расположены по два в одной строке).
Преобразуйте получившийся набор данных в плоский массив ndarray.
Выведите максимальное, минимальное, среднее значения температур среди существующих значений.
Для решения данной задачи используйте оптимальный тип данных Numpy, учитывая,
что замеры производились в летнее время и температура не падает ниже +15 С.
Разбейте общую последовательность на три равных, чтобы получился двумерный массив 3 x 30 и
сохраните последние 5 значений каждого месяца в текстовый файл (массив размерности 3 x 5)."""
