"""Дробь 49/98 является любопытной, поскольку неопытный математик, пытаясь сократить ее,
будет ошибочно полагать, что 49/98 = 4/8, являющееся истиной, получено вычеркиванием девяток.

Дроби вида 30/50 = 3/5 будем считать тривиальными примерами.

Существует ровно 4 нетривиальных примера дробей подобного типа, которые меньше единицы и
содержат двухзначные числа как в числителе, так и в знаменателе.

Пусть произведение этих четырех дробей дано в виде несократимой дроби
(числитель и знаменатель дроби не имеют общих сомножителей). Найдите знаменатель этой дроби."""